IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_de_regs.xml
<module id="DE_REGS" HW_revision="" description="DE Registers">
	<register id="DECTL" width="32" page="1" offset="0x0" internal="0" description="DE control register">
		<bitfield id="ENABLE" description="DE function enable." begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="MODE" description="DE Mode" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="REENTRYDLY" description="Re-entry delay value" begin="15" end="8" width="8" rwaccess="RW"/>
	</register>
	<register id="DECOMPSEL" width="32" page="1" offset="0x2" internal="0" description="DE comparator source select register">
		<bitfield id="TRIPL" description="Comparator TRIPL source select." begin="5" end="0" width="6" rwaccess="RW"/>
		<bitfield id="TRIPH" description="Comparator TRIPH source select." begin="21" end="16" width="6" rwaccess="RW"/>
	</register>
	<register id="DEACTCTL" width="32" page="1" offset="0x4" internal="0" description="DE Action Control ">
		<bitfield id="PWMA" description="Comparator source select." begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="TRIPSELA" description="Trip source select on PWMA output" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="PWMB" description="Comparator source select." begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="TRIPSELB" description="Trip source select on PWMB output" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="TRIPENABLE" description="Enables PWMTRIP condition to bypassDiode emulation logic." begin="16" end="16" width="1" rwaccess="RW"/>
	</register>
	<register id="DESTS" width="32" page="1" offset="0x6" internal="0" description="DE Status register">
		<bitfield id="DEACTIVE" description="Diode Emulation mode active flag." begin="0" end="0" width="1" rwaccess="R"/>
	</register>
	<register id="DEFRC" width="32" page="1" offset="0x8" internal="0" description="DE Status force register">
		<bitfield id="DEACTIVE" description="Diode Emulation mode active flag force." begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="DECLR" width="32" page="1" offset="0xa" internal="0" description="DE Status clear register">
		<bitfield id="DEACTIVE" description="Diode Emulation mode active flag clear." begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="DEMONCNT" width="32" page="1" offset="0x10" internal="0" description="DE trip monitor counter">
		<bitfield id="CNT" description="DEACTIVE monitor counter" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="DEMONCTL" width="32" page="1" offset="0x12" internal="0" description="DE monitor mode control">
		<bitfield id="ENABLE" description="DEACTIVE monitor counter" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="DEMONSTEP" width="32" page="1" offset="0x14" internal="0" description="DE monitor counter step">
		<bitfield id="INCSTEP" description="DE monitor counter increment step." begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="DECSTEP" description="DE monitor counter decrement step." begin="23" end="16" width="8" rwaccess="RW"/>
	</register>
	<register id="DEMONTHRES" width="32" page="1" offset="0x16" internal="0" description="DE monitor counter threshold">
		<bitfield id="THRESHOLD" description="DE monitor counter compare threshold." begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
</module>
